Tekla Open API Reference for Tekla Structures 2025
BoltGroup.BoltPositions Property
 Gets the single bolt positions. All the bolt positions are in the XY-plane defined by the bolt group coordinate system. The given positions are in relation to the transformation plane in which the bolt group was selected.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ArrayList BoltPositions { get; }
Public ReadOnly Property BoltPositions As ArrayList
	Get
Property Value
Type: ArrayList
See Also
Reference
BoltGroup Class
Tekla.Structures.Model Namespace